{
  "architectures": [
    "Moondream"
  ],
  "model_type": "moondream1",
  "phi_config": {
    "architectures": [
      "PhiForCausalLM"
    ],
    "attention_dropout": 0.0,
    "bos_token_id": 50256,
    "embd_pdrop": 0.0,
    "eos_token_id": 50256,
    "hidden_act": "gelu_new",
    "hidden_size": 2048,
    "initializer_range": 0.02,
    "intermediate_size": 8192,
    "layer_norm_eps": 1e-05,
    "max_position_embeddings": 2048,
    "model_type": "phi",
    "num_attention_heads": 32,
    "num_hidden_layers": 24,
    "num_key_value_heads": 32,
    "partial_rotary_factor": 0.5,
    "qk_layernorm": false,
    "resid_pdrop": 0.0,
    "rope_scaling": null,
    "rope_theta": 10000.0,
    "tie_word_embeddings": false,
    "transformers_version": "4.38.2",
    "use_cache": true,
    "vocab_size": 51200
  },
  "torch_dtype": "float16",
  "transformers_version": "4.38.2",
  "image_token_index": -200,
  "transformers.js_config": {
    "use_external_data_format": {
      "decoder_model_merged.onnx": true,
      "decoder_model_merged_fp16.onnx": true
    }
  }
}